package org.example.common.utils;

import java.util.concurrent.ThreadLocalRandom;

import org.springframework.stereotype.Component;

@Component
public class RandomNameGenUtil {

    public String generateRandomKoreanName() {
        String[] first = {"김", "이", "박", "최", "정", "강", "조", "윤", "장", "임", "한", "오", "서", "신", "권", "황", "안",
            "송", "류", "전", "홍", "고", "문", "양", "손", "배", "조", "백", "허", "유", "남", "심", "노", "정", "하", "곽", "성", "차", "주",
            "우", "구", "신", "임", "나", "전", "민", "유", "진", "지", "엄", "채", "원", "천", "방", "공", "강", "현", "함", "변", "염", "양",
            "변", "여", "추", "노", "도", "소", "신", "석", "선", "설", "마", "길", "주", "연", "방", "위", "표", "명", "기", "반", "왕", "금",
            "옥", "육", "인", "맹", "제", "모", "장", "남", "탁", "국", "여", "진", "어", "은", "편", "구", "용"};
        String[] middle = {"가", "강", "건", "경", "고", "관", "구", "규", "근", "기",
            "대", "동", "명", "무", "민", "범", "병", "상", "서", "석",
            "선", "성", "세", "소", "수", "승", "시", "신", "영", "예",
            "용", "우", "운", "원", "유", "윤", "은", "이", "익", "인",
            "재", "정", "제", "종", "주", "준", "중", "지", "찬", "창",
            "천", "철", "태", "하", "한", "현", "호", "훈", "희"};
        String[] last = {"가", "강", "경", "곤", "광", "구", "균", "나", "남", "늘",
            "다", "대", "덕", "동", "림", "명", "민", "범", "별", "상",
            "서", "석", "선", "성", "세", "소", "수", "숙", "순", "슬",
            "승", "시", "신", "아", "영", "옥", "완", "용", "우", "원",
            "유", "윤", "율", "은", "의", "이", "익", "인", "재", "정",
            "제", "종", "주", "준", "중", "지", "찬", "창", "채", "철",
            "하", "한", "현", "형", "혜", "호", "환", "훈", "희"};

        return first[randomIndex(first.length)]
                + middle[randomIndex(middle.length)]
                + last[randomIndex(last.length)];
    }

    private int randomIndex(int bound) {
        return ThreadLocalRandom.current().nextInt(bound);
    }

}
